app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "activation_digest") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
      @user=User.new(user_params)     #params[:user] - have entire details of user

      if @user.email=="pauljoegeorge@gmail.com"
        @user.admin = true
      end
      if @user.save